Revit 2027 API
FabricationPart.CanAdjustEndLength Method
 Checks if the end of fabrication part can be adjusted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanAdjustEndLength(
	Connector connector
)
Public Function CanAdjustEndLength (
	connector As Connector
) As Boolean
public:
bool CanAdjustEndLength(
	Connector^ connector
)
member CanAdjustEndLength :
        connector : Connector -> bool
Parameters
connector Connector
 The connector of the fabrication part to adjust length.
Return Value
Boolean
 True if the end of fabrication part can be adjusted.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace